okay
STk> (load "~/Documents/projects/CIS61-STk/Project1/twenty-one.scm")
okay
STk> (valentine '("qd" "4d" "2c" "2h") "5c")
#t
STk> (valentine '("qd" "4d" "2c" "2h") "5c")
#t
STk> (valentine '("qd" "4d" "4c" "2h") "5c")
#f
STk> (transcript-off)
