okay
STk> (load "~/Documents/projects/CIS61-STk/Chapter2/assign4/p10.scm")
okay
STk> (define x (list (list 1 2) (list 3 4)))
x
STk> x

((1 2) (3 4))
STk> (fringe x)
(1 2 3 4)
STk> (fringe (list x x))
(1 2 3 4 1 2 3 4)
STk> (transcript-off)
