okay
STk> (load "~/Documents/projects/CIS61-STk/Chapter2/assign4/p3.scm")
okay
STk> (last-pair (list 23 72 149 34))
(34)
STk> (last-pair (list 1 2 3 4 5 6 7 8 9 000))
(0)

;; That's interesting. It simplifies 000 to 0...

STk> (last-pair (list 1 2 3 4 5 6 7 8 9 111))
(111)
STk> (transcript-off)
