okay
STk> (ask miike 'look-around)
(fries falafel iphone macbookpro nintendo-3ds)
STk> (ask miike 'take 3ds)

miike took nintendo-3ds
taken
STk> (ask nasty 'type)
thief
STk> (ask kevin 'type)
police
STk> (ask miike 'type)
person
STk> (ask miike 'go-directly-to sproul-plaza)


miike moved from dormitory to sproul-plaza
appeared
STk> (ask miike 'look-around)
(nintendo-3ds diet-coke nasty)
STk> (ask miike 'take diet-coke)

miike took diet-coke
taken
STk> (ask nasty 'take 3ds)

nasty took nintendo-3ds

Yaaah! miike is upset!
taken
STk> (ask nasty 'take diet-coke)

nasty took diet-coke

Yaaah! miike is upset!
taken
STk> (ask miike 'possessions)
()
STk> (whereis kevin)
telegraph-ave
STk> (ask nasty 'go 'south)


nasty moved from sproul-plaza to telegraph-ave
"There are tie-dyed shirts as far as you can see..."
Crime does not pay
kevin took diet-coke

Yaaah! nasty is upset!

kevin took nintendo-3ds

Yaaah! nasty is upset!


nasty moved from telegraph-ave to jail
appeared
STk> (ask miike 'go 'south)


miike moved from sproul-plaza to telegraph-ave
"There are tie-dyed shirts as far as you can see..."
appeared
STk> (whereis kevin)
telegraph-ave
STk> (whereis miike)
telegraph-ave
STk> (whereis nasty)
jail
STk> (ask kevin 'possessions)
(#[closure arglist=(message) 205b210] #[closure arglist=(message) 203e9e0])
STk> (ask kevin 'strength)
50
STk> (ask nasty 'strength)
35
STk> (ask miike 'strength)
10
STk> (transcript-off)
