okay
STk> (load "~/Documents/Projects/lisp/CIS61-STk/Chapter2/assign5/p3.scm")
okay
STk> (define acc (make-account 100))
acc
STk> ((acc 'deposit) 500)
600
STk> ((acc 'withdraw) 45)
555
STk> ((acc 'deposit) 200)
755
STk> (acc 'balance)
755
STk> (acc 'init-balance)
100
STk> (transcript-off)
